# <span style="color:blue; font-weight:bold;">3강. 자유자재의 데이터 가공</span>
- 둘째마당 (06)
- pp.131-176 (46쪽)

## 06-1. 데이터 전처리 - 원하는 형태로 데이터 가공하기(132쪽)
- 데이터 전처리 : 분석에 적합하게 데이터를 가공하는 작업
- 추출, 종류별 분류, 데이터 합치기 등
- 판다스(pandas) : 전처리에 가장 많이 사용되는 패키지

주요 함수들
- query( ) : 행 추출
- df[ ] : 열(변수) 추출
- sort_value( ) : 정렬
- groupby( ) : 집단별로 나누기
- assign( ) : 변수 추가
- agg( ) : 통계치 구하기
- merge( ) : 데이터 합치기(열)
- concat( ) : 데이터 합치기(행)

## 06-2. 조건에 맞는 데이터만 추출하기(133-142쪽)

### [Do it! 실습] 조건에 맞는 데이터만 추출하기(133쪽)

In [1]:
import pandas as pd
# exam.csv를 불러와서 변수 exam에 저장하라

In [2]:
# exam에서 nclass가 1인 경우만 추출: query() 사용

In [3]:
# 2반의 경우만 추출

In [4]:
# 1반이 아닌 경우

In [5]:
# 3반이 아닌 경우

### [Do it! 실습] 초과, 미만, 이상, 이하 조건 걸기(136쪽)

In [6]:
# 수학 점수가 50점을 초과한 경우

In [7]:
# 수학 점수가 50점 미만인 경우

In [8]:
# 영어 점수가 50점 이상인 경우

### [Do it! 실습] 여러 조건을 충족하는 행 추출하기(138쪽)

In [9]:
# 1반이면서 수학 점수가 50점 이상인 경우

In [10]:
# 2반이면서 영어 점수가 80점 이상인 경우

### [Do it! 실습] 여러 조건 중 하나 이상 충족하는 행 추출하기(138쪽)

In [11]:
# 수학 점수가 90점 이상이거나 영어 점수가 90점 이상인 경우

In [12]:
# 영어 점수가 90점 미만이거나 과학 점수가 50점 미만인 경우

### [Do it! 실습] 목록에 해당하는 행 추출하기(139쪽)

In [13]:
# 1, 3, 5반에 해당하면 추출

In [14]:
# 1, 3, 5반에 해당하면 추출 : in과 []를 사용

### [Do it! 실습] 추출한 행으로 데이터 만들기(140쪽)
- 1반과 2반을 추출해 각각 새 데이터로 만든 다음,
- 두 반의 수학 점수 평균을 구하기

In [15]:
# nclass가 1인 행 추출해 nclass1에 할당

# nclass가 2인 행 추출해 nclass1에 할당

In [16]:
# 1반 수학 점수 평균 구하기

In [17]:
# 2반 수학 점수 평균 구하기

### [Do it! 실습] 문자 변수를 이용해 조건에 맞는 행 추출하기(141쪽)
- 전체 조건을 감싸는 따옴표와, 추출할 문자를 감싸는 따옴표를 서로 다른 모양으로 입력해야 함.
- query(' ')처럼 작은 따옴표로 감쌌다면, 추출할 문자는 var == " "처럼 큰 따옴표로 감싸야 함.

In [18]:
# 예제 df 생성
df = pd.DataFrame({'sex'     : ['F', 'M', 'F', 'M'],
                   'country' : ['Korea', 'China', 'Japan', 'USA']})
df

  sex country
0   F   Korea
1   M   China
2   F   Japan
3   M     USA

In [19]:
# 전체 조건에 작은따옴표, 추출할 문자에 큰따옴표 사용: 여성 & 한국

In [20]:
# 반대로 전체 조건을 큰따옴표로 감쌌다면 추출할 문자는 작은따옴표로 감싸야 함: 남성 & 중국

In [21]:
# 전체 조건과 추출할 문자에 모두 작은따옴표 사용 => 에러
df.query('sex == 'F' & country == 'Korea'')

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3075118419.py, line 2)

### [개인 실습] 혼자서 해보기(144쪽)
- mpg 데이터를 이용해 분석 문제를 해결해 보세요

#### Q1 : 자동차 배기량에 따른 고속도로 연비
- displ(배기량)이 4 이하인 자동차와 5 이상인 자동차 중 어떤 자동차의 hwy(고속도로 연비) 평균이 더 높은지 알아보세요

In [22]:
# mpg.csv 파일을 불러와서 변수 mpg에 넣어라

In [23]:
# 배기량(disp) 4 이하 자동차를 추출해서 변수 car_until4에 넣어라

# 배기량(disp) 5 이상 자동차를 추출해서 변수 car_from5에 넣어라

# 두 종류 자동차의 고속도로 연비(hwy) 평균을 각각 출력하고 어느 쪽이 높은지 비교하라.

#### Q2 : 자동차 제조 회사별 도시 연비
- 'audi'와 'toyota' 중 어느 manufacturer(자동차 제조 회사)의 cty(도시 연비) 평균이 더 높은지 알아보세요

In [47]:
mpg[:3]

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact

In [24]:
# 아우디와 토요타 회사를 각각 추출해서 audi, toyota라는 변수에 각각 할당하라.

# 두 회사 자동차의 도시 연비(cty) 평균을 각각 출력하고 어느 쪽이 높은지 비교하라.

#### Q3 : 자동차별 고속도로 연비
- 'chevrolet', 'ford', 'honda' 자동차의 고속도로 연비 평균을 알아보려고 합니다. 세 회사의 데이터를 추출한 다음 hwy 전체 평균을 구해 보세요

In [25]:
# 세 회사의 데이터를 각각 추출하여, chevrolet, ford, honda라는 변수에 각각 할당하라.

# 세 회사 자동차의 고속도로 연비(hwy) 평균을 각각 출력하라.

In [26]:
# 세 회사 고속도로 연비의 전체 평균을 구하라 (in, [ ] 사용). 변수는 three_manu에 할당.

## 06-3. 필요한 변수만 추출하기(145-150쪽)

### [Do it! 실습] 변수 추출하기(145쪽)

In [28]:
# exam에서 math 변수만 추출하기
exam['math']

0     50
1     60
2     45
3     30
4     25
5     50
6     80
7     90
8     20
9     50
10    65
11    45
12    46
13    48
14    75
15    58
16    65
17    80
18    89
19    78
Name: math, dtype: int64

In [29]:
# exam에서 english 변수만 추출하기
exam['english']

0     98
1     97
2     86
3     98
4     80
5     89
6     90
7     78
8     98
9     98
10    65
11    85
12    98
13    87
14    56
15    98
16    68
17    78
18    68
19    83
Name: english, dtype: int64

In [30]:
# 여러 변수 추출하기
exam[['nclass', 'math', 'english']]

    nclass  math  english
0        1    50       98
1        1    60       97
2        1    45       86
3        1    30       98
4        2    25       80
5        2    50       89
6        2    80       90
7        2    90       78
8        3    20       98
9        3    50       98
10       3    65       65
11       3    45       85
12       4    46       98
13       4    48       87
14       4    75       56
15       4    58       98
16       5    65       68
17       5    80       78
18       5    89       68
19       5    78       83

### [Do it! 실습] 변수 제거하기(147쪽)

In [31]:
exam.drop(columns = 'math') # math 제거

    id  nclass  english  science
0    1       1       98       50
1    2       1       97       60
2    3       1       86       78
3    4       1       98       58
4    5       2       80       65
5    6       2       89       98
6    7       2       90       45
7    8       2       78       25
8    9       3       98       15
9   10       3       98       45
10  11       3       65       65
11  12       3       85       32
12  13       4       98       65
13  14       4       87       12
14  15       4       56       78
15  16       4       98       65
16  17       5       68       98
17  18       5       78       90
18  19       5       68       87
19  20       5       83       58

In [32]:
# 여러 변수 제거
exam.drop(columns = ['math', 'english'])

    id  nclass  science
0    1       1       50
1    2       1       60
2    3       1       78
3    4       1       58
4    5       2       65
5    6       2       98
6    7       2       45
7    8       2       25
8    9       3       15
9   10       3       45
10  11       3       65
11  12       3       32
12  13       4       65
13  14       4       12
14  15       4       78
15  16       4       65
16  17       5       98
17  18       5       90
18  19       5       87
19  20       5       58

### [Do it! 실습] pandas 함수 조합하기(148쪽)

In [35]:
# query()와 [] 조합하기
# - 1반 학생의 영어 점수 추출

exam.query('nclass == 1')['english']

0    98
1    97
2    86
3    98
Name: english, dtype: int64

In [37]:
# - 수학 점수가 50점 이상인 학생의 id와 math 변수 추출

exam.query('math >= 50')[['id', 'math']]

    id  math
0    1    50
1    2    60
5    6    50
6    7    80
7    8    90
9   10    50
10  11    65
14  15    75
15  16    58
16  17    65
17  18    80
18  19    89
19  20    78

In [44]:
# 일부만 출력하기
# - math가 50 이상인 행만 추출한 다음, id, math 앞부분 5행까지 추출

exam.query('math >= 50')[['id', 'math']].head()

   id  math
0   1    50
1   2    60
5   6    50
6   7    80
7   8    90

In [45]:
# - math가 50 이상인 행만 추출한 다음 id, math 앞부분 10행까지 추출

exam.query('math >= 50')[['id', 'math']].head(10)

    id  math
0    1    50
1    2    60
5    6    50
6    7    80
7    8    90
9   10    50
10  11    65
14  15    75
15  16    58
16  17    65

### [Do it! 실습] 가독성 있게 코드 줄 바꾸기(150쪽)
- 1) 명령어 끝난 부분 뒤에 백슬래서(\)를 입력하고 Enter를 눌러 줄을 바꿈
- 2) Spacebar를 Tab을 이용해 간격을 띄우고 다음 명령어를 입력

In [47]:
exam.query('math > 50') \
    [['id', 'math']] \
    .head(10)

    id  math
1    2    60
6    7    80
7    8    90
10  11    65
14  15    75
15  16    58
16  17    65
17  18    80
18  19    89
19  20    78

### [개인 실습] 혼자서 해보기(150쪽)
- mpg 데이터를 이용해서 분석 문제를 해결하시오

#### Q1. category, cty 변수 추출
- mpg 데이터는 11개 변수로 구성. 이 중 category(자동차 종류), cty(도시 연비) 변수를 추출해서 새로운 데이터를 만드세요.

In [3]:
mpg = pd.read_csv('mpg.csv')
mpg.shape

(234, 11)

In [4]:
# 'category', 'cty' 두 변수로 된 df를 mpg_new 변수에 할당
mpg_new = mpg[['category', 'cty']]
mpg_new

    category  cty
0    compact   18
1    compact   21
2    compact   20
3    compact   21
4    compact   16
..       ...  ...
229  midsize   19
230  midsize   21
231  midsize   16
232  midsize   18
233  midsize   17

[234 rows x 2 columns]

#### Q2 : 자동차 종류별 연비
- 앞에서 추출한 데이터를 이용해 category가 'suv'인 자동차와, 'compact'인 자동차 중 어떤 자동차의 cty 평균이 더 높은지 알아보시오.

In [54]:
mpg_new.query('category == "suv"')['cty'].mean()

13.5

In [55]:
mpg_new.query('category == "compact"')['cty'].mean()

20.127659574468087

## 06-4. 순서대로 정렬하기(151-153쪽)
- df.sort_values()

### [Do it! 실습] 오름차순으로 정렬하기(151쪽)

In [27]:
# excel_exam.xlsx 데이터 불러와서 변수 exam에 넣어라

In [28]:
# exam 데이터를 수학점수 낮은 사람부터 높은 사람 순으로 오름차순 정렬하기

### [Do it! 실습] 내림차순으로 정렬하기(152쪽)

In [29]:
# math 내림차순 정렬

### [Do it! 실습] 여러 정렬 기준 적용하기(152쪽)

In [30]:
# 먼저 반을 기준으로 오름차순 정렬한 다음, 각 반에서 수학 점수를 기준으로 오름차순 정렬

In [31]:
# 먼저 반을 기준으로 오름차순 정렬한 다음, 각 반에서 수학 점수를 기준으로 내림차순 정렬할 경우

### [개인 실습] 혼자서 해보기(153쪽)
- mpg 데이터 이용하여 분석 문제 해결

#### Q1 : 'audi'가 생산한 자동차 중 높은 연비 모델
- 'audi'가 생산한 자동차 중에 어떤 자동차 모델의 hwy(고속도로 연비)가 높은지 알아보려 한다. hwy가 1~5위인 자동차의 데이터를 출력하라

In [32]:
# mpg.csv 파일 불러와서 변수 mpg에 할당하라

In [33]:
# audi 생산 자동차 중 hwy 상위 1-5위 자동차 데이터 출력

## 06-5. 파생변수 추가하기(154-158쪽)
- 파생변수 : 변수를 조합하거나 함수를 이용해서 만든 "새 변수"
- df.assign( ) 이용

### [Do it! 실습] 파생변수 추가하기(154쪽)
- exam 세 과목 점수를 합한 총점 변수 추가하기

In [34]:
# excel_exam.xlsx 데이터 불러와서 변수 exam에 넣어라

In [35]:
# assign() 이용하여 수학, 영어, 과학 점수 합계를 total 변수에 저장 - 새로 만들 변수명에는 따옴표를 입력하지 않음 !!

In [36]:
# 여러 파생변수 한 번에 추가: 세 과목 합계 점수는 total, 세 과목 평균 점수는 mean 변수에 할당

### [Do it! 실습] df.assign( )에 np.where( ) 적용하기(156쪽)
- 조건에 따라 다른 값을 부여한 변수를 추가할 수 있음

In [37]:
import numpy as np

### [Do it! 실습] 추가한 변수를 pandas 함수에 바로 활용하기(156쪽)

In [38]:
# total 변수 추가하고 total의 값을 오름차순으로 정렬하라

### [Do it! 실습] lambda 이용해 데이터 프레임명 줄여 쓰기(157쪽)
- lambda x: 는 데이터 프레임명 자리에 x를 입력하겠다는 의미 -> 코드가 간결해짐

In [39]:
# exam.csv 파일 불러와서 변수 long_name에 저장하라

In [40]:
# 세 과목 합계를 new 변수에 할당: (종전대로) long_name라는 변수명을 직접 입력

In [41]:
# long_name 변수 대신 lambda와 x를 입력

In [44]:
# 앞에서 만든 변수를 활용해 다시 변수 만들기 (파생 변수를 이용해서 다시 파생 변수를 만들 때)
exam.assign(total = exam['math'] + exam['english'] + exam['science'], 
            mean =  lambda x: x['total'] / 3) # 코드를 읽기 불편 -> 두 행 모두 lambda 사용(다음 셀)

    id  nclass  math  english  science  total       mean
0    1       1    50       98       50    198  66.000000
1    2       1    60       97       60    217  72.333333
2    3       1    45       86       78    209  69.666667
3    4       1    30       98       58    186  62.000000
4    5       2    25       80       65    170  56.666667
5    6       2    50       89       98    237  79.000000
6    7       2    80       90       45    215  71.666667
7    8       2    90       78       25    193  64.333333
8    9       3    20       98       15    133  44.333333
9   10       3    50       98       45    193  64.333333
10  11       3    65       65       65    195  65.000000
11  12       3    45       85       32    162  54.000000
12  13       4    46       98       65    209  69.666667
13  14       4    48       87       12    147  49.000000
14  15       4    75       56       78    209  69.666667
15  16       4    58       98       65    221  73.666667
16  17       5    65       68       98    231  77.000000
17  18       5    80       78       90    248  82.666667
18  19       5    89       68       87    244  81.333333
19  20       5    78       83       58    219  73.000000

In [46]:
# 좀 더 가독성이 높은 코드: lambda 함수 사용

In [ ]:
# 오류 발생 경우
exam.assign(total = exam['math'] + exam['english'] + exam['science'], 
            mean =  exam['total'] / 3)

### [개인 실습] 혼자서 해보기(158쪽)
- mpg 데이터는 연비를 나타내는 변수가 hwy(고속도로 연비), cty(도시 연비) 두 종류로 분리되어 있다. 두 변수를 각각 활용하는 대신 하나의 합산 연비 변수를 만들어 분석하려고 한다.

#### Q1 : mpg 데이터 복사본을 만들고, cty와 hwy를 더한 '합산 연비 변수'를 추가하시오
- 힌트: df.assign()을 적용한 결과를 =를 이용해 데이터 프레임에 할당하는 형태로 코드를 작성해야 함

In [17]:
# mpg.csv 파일 불러와서 mpg에 할당하고 다시 이것을 복사해서 mpg_new 변수에 저장하라
mpg = pd.read_csv('mpg.csv')
mpg_new = mpg.copy()
mpg_new

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [24]:
# 도시 연비와 고속도로 연비를 합한 값을 total 변수에 할당한 뒤 결과 df를 다시 mpg_new 변수에 담아라
mpg_new = mpg_new.assign(total = mpg_new['cty'] + mpg_new['hwy'])
mpg_new

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,47
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,50
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,51
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,51
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,42
...,...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,47
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,50
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,42
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,44
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,43

#### Q2 : 앞에서 만든 '합산 연비 변수'를 2로 나눠 '평균 연비 변수'를 추가하세요

In [29]:
# 평균 연비 변수를 mean에 할당하라
mpg_new = mpg_new.assign(mean = mpg_new['total'] / 2)
mpg_new

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,average,mean
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,47,23.5,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,50,25.0,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,51,25.5,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,51,25.5,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,42,21.0,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,47,23.5,23.5
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,50,25.0,25.0
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,42,21.0,21.0
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,44,22.0,22.0
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,43,21.5,21.5

#### Q3 : '평균 연비 변수'가 가장 높은 자동차 3종의 데이터를 출력하세요
- 힌트 : sort_values()와 head()를 조합하면 됩니다.

In [31]:
mpg_new.sort_values('mean', ascending = False).head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,average,mean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0,35.0

#### Q4 : 1~3번 문제를 해결할 수 있는 하나로 연결된 pandas 구문을 만들어 실행해 보세요. 데이터는 복사본 대신 mpg 원본을 이용하세요
- 힌트 : 앞에서 만든 코드를 연결하면 됩니다. 변수를 추가하는 작업을 하나의 assign()으로 구성하면 코드를 더 간결하게 만들 수 있습니다.

In [36]:
mpg.assign(total = lambda x: x['cty'] + x['hwy'], \
           mean  = lambda x: x['total'] / 2) \
   .sort_values('mean', ascending = False) \
   .head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total,mean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0

## 06-6. 집단별로 요약하기(159-166쪽)
- '집단별 평균', '집단별 빈도'처럼 각 집단을 요약한 값을 구할 때 -> df.groupby()와 df.agg()를 사용
- 집단 간에 어떤 차이가 있는지 쉽게 파악 가능

### [Do it! 실습] 집단별로 요약하기(159쪽)

- 전체 요약 통계량 구하기 : df.agg() 사용
    - df.agg()에 mean_math = ('math', 'mean')처럼 요약값 할당한 변수명과 =를 입력한 다음, 
    - 값을 요약하는데 사용할 변수와 함수를 괄호 안에 나열

In [49]:
# exam.csv 불러와서 exam 변수에 저장하라

In [50]:
# agg() 사용해서 수학 성적 평균을 구하고 그값을 변수 mean_math에 할당하라
# 변수에 따옴표 넣지 않음. 함수명 뒤에 () 넣지 않음

In [51]:
# mean() 이용하여 수학 성적 평균을 구하라
exam['math'].mean()  # 수학의 전체 평균. # agg()는 groupby()에 적용해 집단별 요약값 구할 때 사용

57.45

집단별 요약 통계량 구하기
- df.groupby()에 변수를 지정하면 변수의 범주별로 데이터를 분리
- 여기에 agg()를 적용하면, 집단별 요약 통계량이 나옴.

In [52]:
# 반별 수학 평균

In [53]:
# 변수를 인덱스로 바꾸지 않기
exam.groupby('nclass', as_index = False) \
    .agg(mean_math = ('math', 'mean'))

   nclass  mean_math
0       1      46.25
1       2      61.25
2       3      45.00
3       4      56.75
4       5      78.00

여러 요약 통계량 한 번에 구하기
- df.agg()로 여러 요약 통계량을 한 번에 구할 수 있음. =:= df.assign()

In [54]:
exam.groupby('nclass') \
    .agg(mean_math   = ('math', 'mean'), 
         sum_math    = ('math', 'sum'),
         median_math = ('math', 'median'),
         n           = ('nclass', 'count'))  # 빈도(학생 수)

        mean_math  sum_math  median_math  n
nclass
1           46.25       185         47.5  4
2           61.25       245         65.0  4
3           45.00       180         47.5  4
4           56.75       227         53.0  4
5           78.00       312         79.0  4

### [Do it! 실습] 집단별로 다시 집단 나누기(163쪽)
- groupby()에 여러 변수를 지정하면, 집단을 나눈 다음 다시 하위 집단으로 나눌 수 있음.

In [57]:
# mpg 확인
mpg.head(3)

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact

In [58]:
# mpg 데이터로, 제조 회사별 집단을 나눈 다음 / 다시 구동 방식별로 나눠  -> 도시 연비 평균을 구하기
# dry의 4년 사륜구동, f는 전륜구동, r은 후륜구동을 의미

In [60]:
# audi 회사가 생산한 자동차의 구동방식(drv)별 자동차 대수

In [61]:
# chevrolet의 drv별 자동차 생산 대수

### [Do it! 실습] pandas 함수 조합하기(165쪽)

#### Q: suv 합산 연비 평균
- 제조 회사별로 'suv' 자동차의 도시 및 고속도로 합산 연비 평균을 구해 내림차순으로 정렬하고, 1~5위까지 출력하기

- 절차가 복잡해 보이는 분석도 pandas 함수를 조합하면 코드 몇 줄로 간단히 해결할 수 있다.
- 절차
    - 1. suv 추출 ----------------- query()
    - 2. 합산 연비 변수 만들기 ---- assign()
    - 3. 회사별로 분리 ------------ groupby()
    - 4. 합산 연비 평균 구하기 ---- agg()
    - 5. 내림차순 정렬 ------------ sort_values()
    - 6. 1~5위까지 출력 ----------- head()

### [개인 실습] 혼자서 해보기(166쪽)
- mpg 데이터를 이용해 분석 문제를 해결해 보세요

#### Q1: mpg 데이터의 category는 자동차를 특징에 따라 'suv', 'compact' 등 일곱 종류로 분류한 변수입니다. 어떤 차종의 도시 연비가 높은지 비교해 보려고 합니다. category별 cty 평균을 구해 보세요
- 힌트 : groupby()를 이용해 category별로 나눈 다음 agg()를 이용해 cty 평균을 구하면 됩니다.

In [41]:
mpg.head(3)

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact

In [62]:
# category별 도시 연비 평균

#### Q2: 앞 문제 출력 결과에서, 어떤 차종의 도시 연비가 높은지 쉽게 알아볼 수 있도록, cty 평균이 높은 순으로 정렬해 출력하세요

#### Q3: 어떤 회사 자동차의 hwy(고속도로 연비)가 가장 높은지 알아보려 한다. hwy 평균이 가장 높은 회사 세 곳을 출력하라

#### Q4: 어떤 회사에서 'compact' 차종을 가장 많이 생산하는지 알아보려 한다. 회사별 'compact' 차종 수를 내림차순으로 정렬해 출력하라

## 06-7. 데이터 합치기(167-172쪽)

### [Do it! 실습] 가로로 합치기(168쪽)

In [63]:
# 중간고사 데이터 만들기
test1 = pd.DataFrame({'id'      : [1, 2, 3, 4, 5], 
                      'medterm' : [60, 80, 70, 90, 85]})

# 기말고사 데이터 만들기
test2 = pd.DataFrame({'id'      : [1, 2, 3, 4, 5],
                      'final'   : [70, 83, 65, 95, 80]})

In [80]:
test1

   id  medterm
0   1       60
1   2       80
2   3       70
3   4       90
4   5       85

In [81]:
test2

   id  final
0   1     70
1   2     83
2   3     65
3   4     95
4   5     80

In [64]:
# id 기준으로 합쳐서 total에 할당

In [65]:
# 다른 데이터를 활용해 변수 추가하기 
## 'exam.csv' 불러와서 변수 exam에 저장하기

In [66]:
# 새 데이터 프레임 생성해서 변수 name에 저장
name = pd.DataFrame({'nclass'  : [1, 2, 3, 4, 5],
                     'teacher' : ['kim', 'lee', 'park', 'choi', 'jung']})
name

   nclass teacher
0       1     kim
1       2     lee
2       3    park
3       4    choi
4       5    jung

In [67]:
# 반별 담임교사 명단을 반영한 시험 데이터: 변수는 exam_new에 넣어라

### [Do it! 실습] 세로로 합치기(170쪽)

In [68]:
# 학생 1-5반 시험 데이터 만들기
group_a = pd.DataFrame({'id'   : [1, 2, 3, 4, 5], 
                        'test' : [60, 80, 70, 90, 85]})

# 학생 6-10번 시험 데이터 만들기
group_b = pd.DataFrame({'id'   : [6, 7, 8, 9, 10],
                        'test' : [70, 83, 65, 95, 80]})

In [92]:
group_a

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85

In [93]:
group_b

   id  test
0   6    70
1   7    83
2   8    65
3   9    95
4  10    80

In [69]:
# group_a, group_b를 세로로 합해서 이를 group_all에 저장하라

In [70]:
# 앞의 결과에서 인덱스 번호를 일련번호로 새로 지정하라

### [개인 실습] 혼자서 해보기(173쪽)
- mpg 데이터를 이용해 분석 문제를 해결하시오

In [98]:
mpg.head(3)

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact

In [71]:
# 새로운 데이터 프레임 생성: 자동차 연료별 가격

fuel = pd.DataFrame({'fl'       : ['c', 'd', 'e', 'p', 'r'],
                     'price_fl' : [2.35, 2.38, 2.11, 2.76, 2.22]})
fuel

  fl  price_fl
0  c      2.35
1  d      2.38
2  e      2.11
3  p      2.76
4  r      2.22

#### Q1: fuel 데이터를 이용해 mpg 데이터에 price_fl(연료가격) 변수를 추가하라

#### Q2: 연료 가격 변수가 잘 추가됐는지 확인하기 위해 model, fl, price_fl 변수를 추출해 앞부분 5행을 출력하라

### [분석 도전]
- 미국 동북중부 437개 지역 인구통계 정보를 담고 있는 midwest.csv를 사용해 데이터 분석 문제를 해결하라

In [73]:
# midwest.csv 파일 불러와서 변수 midwest에 저장하라

In [76]:
# 문제 1: popadults는 해당 지역의 성인 인구, poptotal은 전체 인구를 나태닌다. midwest 데이터에 '전체 인구 대비 미성년 인구 백분율'을 변수 midwest_new에 추가하라

In [78]:
# 문제 2: 미성년 인구 백분율을 변수 ratio에 넣고, 이 백분율이 가장 높은 상위 5개 county(지역)의 미성년 인구 백분율을 출력하라

In [77]:
# 문제 3: 분류표 기준에 따라 미성년 비율 등급 변수를 추가하고, 각 등급에 몇 개의 지역이 있는지 알아보라

## 분류표 데이터 생성해서 변수 class_table에 저장하라

In [79]:
# 미성년 비율 등급을 변수 grade에 추가: 40이상이면 'large', 30이상이면 'middle', 30미만이면 'small'을 입력하라

In [80]:
# 각 등급별 지역 수 파악

In [81]:
# 문제 4: popasian은 해당 지역의 아시아인 인구를 나타낸다. 
# '전체 인구 대비 아시아인 인구 백분율' 변수를 추가하고, 
# 하위 10개 지역의 state(주), county(지역), 아시아인 인구 백분율을 출력하라
# 아시아인 인구 백분율 변수는 ratio_asian으로 사용하라

# The End of Notebook